#  Дан словарь с произвольным количеством элементов. Выяснить
#  имеется ли в нем элемент с ключом «фрукт = яблоко» и если он отсутствует, то
#  добавить его в словарь. Вывести на экран первоначальный словарь и измененный.
a = {"овощ":'помидор',"ягода": 'клубника'}
print(a)
for i in a:
    if ["фрукт"]:
        break
    else:
        a["фрукт"]='яблоко'
print(a)